var hints = [
    'Дифузія -  процес взаємного проникнення молекул або атомів однієї речовини поміж молекул або атомів іншої, що зазвичай приводить до вирівнювання їх концентрацій у всьому займаному обємі.',
    'Гравітаційне червоне зміщення — явище зсуву частоти випромінюваного світла у червоний бік спектру в міру його віддалення від масивних тіл. Гравітаційне червоне зміщення описується в межах загальної теорії відносності та є одним із головних ефектів цієї теорії.',
    'Квазари — позагалактичні об*єкти, які мають зореподібні зображення й потужні емісійні лінії з великим червоним зміщенням у спектрі. Для деяких квазарів властива швидка зміна яскравості в оптичному діапазоні, і ще швидша — в рентгенівському. Це свідчить про малі розміри квазарів (порядку розміру Сонячної системи або менші), тому що об*єкт не може змінювати світність за коротший час, ніж світло доходить від одного його кінця до іншого.',
    'Екліптика — уявна лінія (велике коло) небесної сфери, вздовж якої центр сонячного диска протягом року пересувається серед зір. Оскільки річний рух Сонця відбиває реальне обертання Землі (а точніше — системи Земля-Місяць) по орбіті, екліптика є слідом від перетину небесної сфери з площиною земної орбіти.',
    'Гіппаркос — космічний телескоп Європейського космічного агентства, призначений для астрометричних завдань: вимір координат, паралаксів та власних рухів світил і відстаней до них.',
    'Гравітаційна лінза — масивне тіло (планета, зоря) або система тіл (галактика, скупчення галактик), що викривлює своїм гравітаційним полем напрямок поширення випромінювання, подібно тому, як викривляє світловий промінь звичайна лінза.',
    'Геодезична прецесія (прецесія де-Сіттера) — ефект зміни напрямку осі обертання тіла, яке рухається в викривленому просторі-часі, передбачений загальною теорією відносності , відноситься до її гравімагнітних ефектів.',
    'Пульсар  — нейтронна зоря, яка обертається та має потужне магнітне поле, і тому є космічним джерелом пульсуючого електромагнітного випромінювання з магнітних полюсів. Якщо промені з магнітних полюсів спрямовані на Землю, це випромінення може реєструватись на Землі у вигляді імпульсів — сплесків, які періодично повторюються (схоже на те, як світло від ліхтаря маяка можна побачити лише коли воно спрямовано у напрямку спостерігача).',
    "Закон всесвітнього тяжіння — фізичний закон, що описує гравітаційну взаємодію в рамках Ньютонівської механіки. Закон стверджує, що сила притягання між двома тілами (матеріальними точками) прямо пропорційна добутку їхніх мас, і обернено пропорційна квадрату відстані між ними. Закон всесвітнього тяжіння сформулював Ісаак Ньютон у 1687 році у трактаті «Математичні начала натуральної філософії»",
    "Космологічна стала — параметр рівняння Ейнштейна, яке описує метрику простору-часу та її зв'язок з речовиною. Позначається зазвичай грецькою літерою Lambda. Особливістю космологічної сталої є те, що вона є однаковою для всього простору. Альберт Ейнштейн дописав член із космологічною сталою до своїх рівнянь для того, щоб отримати стаціонарний Всесвіт. Однак, було показано, що отриманий Ейнштейном розв'язок все одно нестабільний. Окрім того, астрономічні спостереження показали, що Всесвіт розширюється, про що свідчить червоний зсув спектральних ліній. Тому Ейнштейн відмовився від космологічної сталої. Але, інтерес до космологічної сталої відновився у зв'язку з новими спостереженнями над рухом галактик, які свідчать про існування у Всесвіті більшої маси, ніж можна спостерігати — темної матерії. Тому точне числове значення космологічної сталої залишається невідомим.",
    "Гравітаційний колапс - катастрофічно швидке стиснення масивних тіл під дією гравітаційних сил. Гравітаційним колапсом може закінчуватися еволюція зірок з масою понад три сонячних мас. Після вичерпання в таких зірках матеріалу для термоядерних реакцій вони втрачають свою механічну стійкість і починають з збільшується швидкістю стискатися до центру. Якщо зростаюче внутрішній тиск зупиняє гравітаційне стиснення, то центральна область зірки стає надщільний нейтронної зіркою, що може супроводжуватися скиданням оболонки і спостерігатися як спалах наднової зірки. Однак якщо маса зірки перевищить межа Оппенгеймера - Волкова, то колапс триває до її перетворення в чорну діру.",
    "Великий адронний колайдер — найбільший у світі прискорювач елементарних частинок.",
    "Гравітаційна сингулярність — це точка, де кривизна простору-часу прагне до нескінченного значення. Згідно з деякими фізичними теоріями, Всесвіт міг початися і закінчитися гравітаційними сингулярностями, Великим вибухом і Великим Хрустом відповідно.",
    "Аристотель вважав, що рух, хоча і не володіє повною дійсністю, чистим буттям, але не є небуття. Воно є перехід від можливого до дійсного, той процес, та діяльність, за допомогою якої форма втілюється в матеріальній потенції.",
    "Поперечна хвиля — хвиля, у якій коливання відбуваються в площині, перпендикулярній до напрямку поширення. Хвиля, у якій коливання паралельні напрямку руху, називається поздовжньою.",
    "Ефірне поле - якесь енергетичне поле, що виконує функцію управління живим організмом. Це енергетичне поле за багатьма параметрами відрізняється від звичайного електромагнітного поля.",
    "Інерційна система відліку - система відліку, в якій всі вільні тіла рухаються прямолінійно і рівномірно або спочивають. Існування систем, що мають зазначену властивість, постулюється першим законом Ньютона.",
    "Рівняння Максвелла - система рівнянь у диференціальній або інтегральній формі, що описують електромагнітне поле та його зв'язок з електричними зарядами та струмами у вакуумі та суцільних середовищах. Разом з виразом для сили Лоренца, що задає міру впливу електромагнітного поля на заряджені частинки, ці рівняння утворюють повну систему рівнянь класичної електродинаміки, яку іноді називають рівняннями Максвелла — Лоренца.",
    "Ефір - гіпотетичне середовище, матеріал, крізь який протягом XIX століття, науковці пояснювали розповсюджування електромагнітних хвиль і гравітаційної взаємодії",
    "Нейтронна зірка - космічне тіло, що є одним з можливих результатів еволюції зірок, що складається в основному з нейтронної серцевини, покритої порівняно тонкою (близько 1 км) корою речовини у вигляді важких атомних ядер та електронів."
]

function GetElementAndDisplay(index) {
    let display = document.getElementById("field");

    display.textContent = hints[index - 1];
   
}

function DisplayClear() {
    let display = document.getElementById("field");
    display.textContent = " ";
}

